{
"time":"24HH",
"0014":{"todo01" : "make to-do list."},
"0018":"I will be working on my workflow for this period",
"0019":"I am allowed to type in my thoughts into the text-editor",
"0020":"It seems I am easily able to achieve one statement typed per minute in plain english",
"0021":"I can set a goal to type faster, more consistently",
"0022":"My goal was to make PrismaticJellyfish within a browser, but now I wonder how fast it will run on a Amazon Tablet",
"0023":"I can test it's speed with a button and preview.html that merely has buttons and none of the PrismaticJellyfish .json-oriented formatting.",
"0024":"This will test the button-based concept within then browser",
"0025":"Part of PrismaticJellyfish was OtterDocs, which would contain a list of tools described in a verbose format with explanations on how to use them and possible integrations with a work-flow/brand.",
"0026":"I feel as though my wrist is getting in pain from this position however. I it may be the flat keyed-keyboard or my desk-layout.",
"0027":"breaktime01",
"0059":"end of breaktime01",
"0100":"I will upload my workflow Template to Github",
"0101":"Should I have an equipment cross-check too?",
"0102":"For now start with .json. It will be a principle of PrismaticJellyfish moving forward to start with .json",
"0103":"Once again to repeat myself a bit much, I will say it again, to reiterate : ",
"0104":{"Prismatic-Principles":"Start with open-source standardization, everything maintains the same heirarchy principles, with the same order of operation. Nothing is ever lost forever, because it can be rebuilt from memory, or easily googled as a Mainstream Programming Paradigm or Principle. Proper document and introduce to Programmers from the beginning. Encourage and inspire with entertaining and visually distinct games, and documentation for the media tools used to create them ( aka. the lower-level apps, below Prismata for higher-end devices ).";},
"0107":"I am having wrist issues again",
"0108":"They seem to act up when I have to reach for the number line. I new I needed a seperate usb-number pad"
;};
