{"time-format":"24HH",
"0110":"started a new log.json",
"0111":"because I reached the end of my browser screen",
"0112":"things you will need every time you program : ",
"0113":{"short-list001":"parser",
"short-list002":"viewport",
"short-list003":"lists";},
"0115":"A viewport may contain : images, text, button, grids",
"0116":"A list may contain : content, files, data, programs",
"0117":"And the role of compiler is mainly one of parsing human-readable text into a hardware output. For example: a lightbulb, parses resistence, into illumination output. We can think of the compiler or parser as basically just another word for cpu or computer or brain, because essentially how it we understand that these things work is that they are all merely reactions to switches. Similar to how a lock is always opened by a given key, an action always gets the same reaction.",
"0118":"We have a base number of switched, 00 for input, 00 for output. This might look like 0000 or 00=00. Normally though in computer-science, we start with a byte which is 0000 0000 which would be 13 in and 13 out.",
"0126":"However, we can assign whatever code value to these numbers that we want, as we might in algebra. This seems to be to be very obvious now, but this concept was not first introduced to me until after college while learning R programming from Udemy/LinkedIn/Coursera. The W3 schools and Codecademy courses in Web Languages I had taken earlier (perhaps confused by my early experience with bbs and Neopets html-learning courses) had never bothered to mention this fundamental philosophical question of letters.",
"0131":"In post-chatgpt and post-pandemic world of today, it seems obvious more than ever the power of words. Yet I cannot excuse myself for letting another day pass believing that there may be youth of 20-2000years of age who have not experienced the delights of wondering what if.",
"0133":"What if the computer could do more? What if there was no reason to be afraid? What if you are the one who will open the door?"
;};
