{"time-format":"24HH",
"1924":"returning to desk now",
"1925":"I'm getting a bit of a crick in my arm from the position of the keyboard and the screen. I will adjust my desk layout now",
"1952":"It turns out my computer chair seat had fallen.",
"1953":"I have now adjusted everything, but I could still use a powerbar next to my computer so that I can have the Laptop, Display, DeskLamp and FloorFan all plugged into the same outlet.",
"1954":"clicking through Lafender Repositories...",
"1955":"there are currently 13 repositories.",
"1956":"they are : ",
"1957":"Tarot-Table",
"1958":"MountainDog",
"1959":"PrismaticJellyfish",
"2000":"RadiantRaccoonNetwork",
"2001":"OtterLake",
"2002":"DocOtter",
"2003":"OtterPad",
"2004":"coon",
"2005":"KamaFish",
"2006":"KamaCage",
"2007":"ZodiacBoard",
"2008":"OtterFloat",
"2009":"and the github.io page, Lafender.github.io",
"2010":"currently I will be working on adding file loaders to the otterpad page. then I will be working on Documentation, and the structure for otterlake/lafendar.github.io.",
"2011":"OtterLake will contain : ",
"2012":"Online instructions on how to use Prismatic Jellyfish,",
"2013":"Documentation for all of the tools used to create Prismatic Jellyfish.",
"2014":"The RadiantRaccoonNetwork Directory and Documentation for apps that can be used to create files for the /Images/ folder in PrismaticJellyfish Files",
"2015":"Guidelines for creating themes, color theory, and links to design paradigms.",
"2016":"A collection of apps that can be customized and downloaded for various devices from the website",
"2017":"A collection of games that can be customized.",
"2018":"A list of popular devices that can run PrismaticJellyfish Projects, and the Tier of Prismatic Apps you can create with and for each Device.",
"2019":"exciting articles to get people excited about math, science, and technology.",
"2020":"I will now write in my journal for a bit, then maybe putter around and do some other things, and return sometime later..."
}
