{"text-format":"24HH",
"1631":"clocking in",
"1632":"opened preview.html with firefox",
"1632":"button still doesnt work. looks like the console in inspector tools found a syntax error",
"1644":"added the array.push() function to add the value of the text input to an array called textarray",
"1645":"fixed syntax errors",
"1646":"clicked button in refreshed preview.html, no syntax errors",
"1647":"new <p>s appear when the enter button is clicked. they read : ",
"1648":"undefined, 0, 1, 2",
"1649":"enterbutton was only clicked 3 times",
"1650":"asking the console to return text array returns : ",
"1651":"Array 3 [ 'hi', 'hi, 'hi' ]",
"1652":"I am thinking that the problem is being caused by my for in statement, which is returning the index instead of the entry",
"1653":"it sounds implausible",
"1654":"reading the javascript for/in page made me realize that the problem might also likely be caused by my agnostic variable assignment for htmlstring, the variable which contains the html string version of the text array which is being stored by textarray",
"1656":"changed the variable in preview.html",
"1658":"reading more in the for/in page on w3 schools showed the for/in statement being used with an array of numbers. the issue was that the x in y in for ( x in y ), the x is the index. for example : ",
"1700":"{fname:'Joe'} x = fname, and y[x] = 'Joe'",
"1703":"everything is working as expected now",
"1704":"should I upload?",
"1705":"what should I do next?",
"1706":"I need to think about what else the app needs to make it useful I guess?",
"1707":"I need to test it on the device. I will need to charge the amazon tablet.",
"1708":"i think that i want the text to scroll up automatically. that is something that i have never done before. i will need to refresh with a screen to bottom on button click. that means that the menu will have to be floating. that should be fine if the previous text isnt editable, but i think that i would like a move button and delete button as well.",
"1709":"I think it would be best to call this completed for now. which means that its break time.",
"1710":"I will also be looking around and deciding what to do next."
}
