{"time-format":"24HHHH",
"2216":"clocking in for a shift",
"2217":"reviewing yesterdays progress",
"2218":"opening files on github",
"2219":"didnt physically/digitally open webpages on computer, remembered that the help-home.html is unstarted",
"2220":"convention is to keep the documentation for how to use a program product in a set of documents known as the help menu or otherwise known as documentation",
"2221":"this acts as something like a user manual for an appliance. There are laws which require program and app developers to reveal certain rules to using a given software just like there are safety standards for appliances. using a product incorrectly voids the warrenty, and might also be illegal. remember that a given developer is not responsible for knowing the law in the same way a customer service rep is not responsible for knowing every law in every country. on the other hand, if an obvious safety hazard is apparent, it will be investigated and if a developer is found responsible they will pay the fee, period. Morally and Legally speaking, you are responsible for breaking laws that don't even exist yet, retroactively in the past, just like in war crimes and war trials.",
"2224":"Please make a documentation folder available with every PrismaticJellyfish Project file(set) (request)",
"2225":"I did not include the Documentation folder in every PrismaticJellyfish Project Directory because I wanted the apps to be as small as a console app. I want every person to make every program, no matter how small, to eliminate the need to have to safety check a simple alternative GUI for a timer app on your phone or computer.",
"2227":"breaktime1",
"2241":"end of breaktime1",
"2242":"today I will : ",
"2243":"side note",
"2244":"it appears that I called DocOtter a documentation system",
"2245":"I don't remember what the documentation system was",
"2246":"I could spitball an idea right now",
"2247":"Documents linked with .json as usual with PrismaticJellyfish",
"2248":"I'm imagining that there was some sort of visual style in mind? Like, themeable documentation? Variable templates/layouts?",
"2249":"What did I mean by Documentation? System I can start to imagine but was I specifying all Software or just ones which require help files",
"2257":"I think it was just templates...",
"2258":"I don't think it's a Worlds First or worth its own-",
"2259":"Oh I get it now!",
"2300":"I was going to teach people how to use text-based programming languages and programming fundamentals.",
"2301":"Now I remember. I was making them githubs even though they aren't Worlds First nessessarily. It was just to keep all of the code for the projects in one place.",
"2302":"Also, there would be no reason to keep all the code open-source for all of my projects so Github makes sense for publication.",
"2303":"And also it would all be properly documented, so the System would evolve organically (this was one of the parts that was dubious towards just now while trying to remember what DocOtter was. OtterLake's Github repo confirmed this idea.",
"2304":"setting up lafender.github.io page",
"2313":"finished setting up lafender.github.io page",
"2314":"attempted to customize ubuntu desktop.",
"2320":"I wish I could buy more keyboards. I should just try the other one maybe, or get creative with my current one.",
"2321":"I'm really starting to appreciate peoples hatred of flat-ket keyboards now. I also don't like how hard I have to hit the keys to get them to depress. Is there a way I could grease them or make them lighter? I think that they are little rubber nubs underneath. Is there a way I can make the rubber softer?",
"2323":"So, anyways, for today, I will be : ",
"2324":"Uploading a Layout for the help.html?",
"2325":"That seems too advanced... ",
"2326":"I would prefer to work on more .mds",
"2327":"clicking on github pages to see what should be done next... ",
"2328":"Oh wait no DocOtter was supposed to be a Document Writer. Huh... OtterLake project was the all of the code to be included on the website, which includes the help files and documentation. I sorted my notes in the wrong directory, oh well.",
"2329":"I'm going to remove the outter layout for OtterPad.",
"2331":"So now that I have OtterPad open, I guess I'll work on that for a bit.",
"2331":"I got dissappointed when I tried to come out of the Hospital and attempt to edit the OtterPad preview .html text directly on lubuntu with vim as soon as I got home. It was overwhelming. as I said, I re-installed all of my Operating Systems because I needed a feeling of starting off with a clean slate. I am also cleaning the house.",
"2334":"Cleaning the house ended up creating multiple offices, and lately I've been prefering using a different office and machine than what I was using to work on PrismaticJellyfish.",
"2335":"I am cozier now on my laptop. Also I am just using a built-in text editor instead of worrying about finding an alternative.to/ one.",
"2336":"okay, I am going to take several long breaks while I slowly ease into OtterPad",
"2336":"If I get bored, I can work on the Lafender.github.io webpage (adding links to working code or html or documentation) ",
"2340":"I can also work on .md documentation. I can either write a tutorial for programming in .md for on my current workflow in OtterLake",
"2341":"I think that DocOtter will be the final app I work on will be Document Writer, which will then be added to PrismaticJellyfish and OtterLake.",
"2343":"OtterPad is to work on loading/saving files, it has to be done first.",
"2344":"Tarot-Table will be done next. Drag and Drop and Randomize Cards functionality. Optional",
"2343":"MountainDog is a sandbox game.",
"2344":"KamaFish is a game where you fish for characters that represent elements in a magic system.",
"2346":"KamaCage is a game where you insert the characters into a gacha and get back an image file of a generated cute digimon-like animal. You can choose to either keep, toss, or combine kama-image elements with following image (characters/elements make certain kama-images more likely to be generated).",
"2348":"ZodiacBoard is a game where you move in a hex grid exploring tiles and casting 4 different spells to either attack, reveal, or escape the other Board Contenters. Winner takes the purse of characters which are also bet at the beginning. 4-12 players, players may play in teams of up to 3, and come in 3 sizes (small, medium, large), which affect player stats."
};
